using System;
using System.Collections.Generic;
using System.Linq;


namespace FinalTask_7_7
{
    public class HomeAddressSelector
    {
        public string Result { get; private set; }

        public HomeAddressSelector()
        {
            SelectAddress();
        }

        private Dictionary<string, HashSet<string>> StreetDatabase()
        {
            var database = new Dictionary<string, HashSet<string>>
    {
        {"1-й Автозаводский проезд", new HashSet<string> {"3", "3 с8", "4 к1", "5", "5 с10"}},
        {"Абельмановская улица", new HashSet<string> {"17А", "2А", "2Б", "3", "4 с1", "4 с7", "4А", "6", "7", "9 с1", "9 с10", "9 с9"}},
        {"Авиамоторная улица", new HashSet<string> {"11", "11 к1", "19А с2", "1А", "2 к1", "2 к17", "2 к19", "3", "5", "7", "9", "10", "10 к1", "14 с9", "19", "19А с3", "2 с8", "20/17", "21", "22/12", "25", "25 с2", "26/5", "27", "28/4", "28/6", "29", "30", "30Б", "31", "32А с1", "32Б", "33", "34", "34 к1", "34 к1 с2", "34 с1", "35", "36/7 с1", "36/7 с4", "37", "39 с2", "40", "44 с1", "44 с10", "44 с11", "44 с12", "44 с2", "44 с3", "44 с5", "44 с6", "44 с7", "44 с8", "44 с9", "47", "48 с1", "48 с2", "48 с6", "49 к2", "50 с3", "50 с7", "51", "51 с2", "51А", "51А к2", "53 к1", "53 к15", "53 к16", "53 к18", "53 к19", "53 к2", "53 к24", "53 к29", "53 к3", "53 к30", "53 к31", "53 к32", "53 к4", "53 к5", "53 к6", "53 к7", "53 к8", "53 к9", "55 к2", "55 к26", "55 к27", "55 к4", "55 к8", "55 к9", "57 с9", "59", "63 с1", "65 с1", "69", "75 с1", "75 с10", "75 с13", "75 с14", "75 с15", "75 с16", "75 с17", "75 с18", "75 с19", "75 с2", "75 с25", "75 с26", "75 с27", "75 с28", "75 с29", "75 с5", "75 с9", "75А", "8", "8 с13", "8 с26", "2 к10", "2 к11", "2 к11А", "2 к11Г", "2 к12", "2 к13", "2 к14", "2 к15", "2 к18", "2 к18А", "2 к2", "2 к20", "2 к21", "2 к22", "2 к23", "2 к3", "2 к30", "2 к5", "2 с1", "2 с10", "2 с11", "2 с11Б", "2 с12", "2 с3", "2 с4", "2 с5", "2 с6", "2 с7", "2 с9", "23", "4 с1", "4 с3", "4А", "53 к23", "6", "6 с1", "6 с2", "6 с20", "6 с4", "8 с6"}},
        {"Байкальская улица", new HashSet<string> {"26/10", "27", "28", "28 к3", "29", "30 к1", "30 к2", "30 к3", "30 к4", "31", "32", "33 к1", "33 к2", "33 к3", "34", "35 к4 с2", "35 с4", "35А", "36", "37А", "37А к1", "38 к1", "38 к2", "38 к3", "38 к4", "10 с3", "11 с2", "11 с4", "11 с5", "12", "12 к1", "12 к2", "12А", "13 с1", "14 к1", "14 к2", "16 к1", "16 к2", "16 к2 с1", "16 к3", "16 к4", "18 к1", "18 к2", "18 к3", "18 к4", "18 с1", "18 с3", "9 с1", "9 с2", "9 с3", "9 с4", "9 с5", "9 с6", "9 с7", "вл.20", "42", "42 к2", "44 к2", "46А", "48", "48 к2 с1", "41/2", "41/3", "41/4", "45", "47", "47 с1", "49", "49 с1", "51 к1 с1", "51 к1 с3", "51 с9", "51А с1"}},
        {"Веерная улица", new HashSet<string> {"10 к1", "10 с1", "11", "12 к1", "14 к2", "16 к2", "16А", "2", "20 к2", "22 к1", "22 к2", "22 к3", "26 к2", "28 к2", "28 к3", "3 к1", "3 к2", "3 к3", "3 к4", "3 к5", "3 к6", "30 к1", "30 к2", "30 к3", "30 к4", "30 к6", "32", "32 к2", "32 к3", "34", "34 к1", "34 к2", "34 к3", "36", "38 к1", "38 к2", "4 к2", "40 к3", "44 к1", "44 к3", "46", "46 к1", "5 к2", "5 к3", "7 к2"}},
        {"Гагаринский переулок", new HashSet<string> {"16", "16 с1", "16 с4", "22 с1", "24", "24/7 с2", "26", "28", "33", "35", "37 с1", "37 с2", "6 с2", "11", "15/7", "15А", "19/3", "20 с1", "21", "23 с1", "23 с2", "25", "27", "29", "3", "31", "5 с1", "5 с2", "5 с3", "7 к2", "7/8 с1", "8А", "9/5", "9/5 с2", "9/5 с3"}},
        {"Давыдковская улица", new HashSet<string> {"1", "1 с2", "1 с3", "1 с4", "1 с5", "1 с6", "10 с7", "10 с8", "11", "12 к1", "12 к2", "12 к3", "12 к6", "12 с7", "16", "17 с1", "2 к3", "2 к5 с6", "2 с6", "3", "3 с3", "3 с5", "4 к2", "4 к3 с2", "5 с2", "6", "7", "7 с5", "8 к1", "8 к2", "9", "9 с2"}},
        {"Елецкая улица", new HashSet<string> {"10 к1", "10 к2", "11 к1", "11 к2", "11 к2 с2", "12 к1", "12 к2", "13", "13А", "14", "14 к2/6", "14/1", "15", "16 к1", "16 к1 с2", "16 к2", "16 к3", "17 к1", "17 к2", "17 к2 с2", "17 к2 с3", "17 к3", "18", "19 к1", "19 к1А", "19 к2", "19 к2 с2", "19 к3", "19 к4", "1А", "20", "23", "26", "26А", "27/25 с2", "31 к1", "31 к1 с3", "33", "33 к2", "33 к3", "33 с2", "33 с3", "35 к1", "35 к3", "35 к3 с3", "35А", "37", "37 с2", "37 с3", "37 с4", "4 к1", "7 к1", "8 к1", "8 к2", "8 к2 с2", "8 к2 с3", "9 к1", "9 к1 с2", "9 к1 с3", "9 к2", "9 к3"}},
        {"Жулебинский бульвар", new HashSet<string> {"2 к2", "5", "8", "13", "15", "16", "23", "23 к2", "25", "25 с2", "27", "28 к1", "30 к1", "32", "31", "31 к1", "33", "34", "36 к1", "4"}},
        {"Каланчёвская улица", new HashSet<string> {"11 с1", "11 с3", "11 с4", "13", "15", "15А", "2/1 с2", "21/40", "29", "29 с2", "31 с1", "31 с15", "4/2 с1", "6/2 с1", "6/2 с2", "6/2 с3", "12", "14 с1", "20", "22", "24", "26 с1", "26 с2", "26 с3", "28", "30", "31 с7", "33", "35", "43", "45", "49", "32", "32/58 с1", "32/61 с1"}},
        {"Ленинградский проспект", new HashSet<string> {"10", "14 к1", "14 с13", "14 с7", "15 с1", "15 с10", "15 с11", "15 с14", "15 с15", "15 с16", "15 с17", "15 с18", "15 с19", "15 с2", "15 с20", "15 с21", "15 с28", "15 с3", "15 с35", "15 с36", "15 с40", "15 с43", "15 с9", "16 к1", "16 к2", "16 с26", "16 с3", "17", "20", "20 с2", "21", "23", "25", "28", "3", "30", "32/2", "34", "5 с1", "5 с3", "5 с8-9", "5/7", "7", "77 к2", "к1", "51 к2", "51 к3", "53", "55", "57", "57 с13", "57 с2", "57А", "59", "63", "65", "69", "71", "71А", "73", "75 с2", "75А", "75Б", "75Г с1", "75Д", "77 к1", "77 к3", "77 к4", "80", "80 к16", "80 к19", "80 к2", "80 к23", "80 к25", "80 к26", "80 к46", "80 к48", "80 к53", "80 к66", "80 кВ", "к1", "80 к10", "80 к4", "80 к44", "80 к5А", "80 к8", "36 с29", "37 к1", "37 к10", "37 к12", "37 к2", "37 к5", "37 к6", "37 к9", "37 с1", "37ак3", "37Б", "37к8", "39", "39 с11", "39 с14", "39 с17", "39 с3", "39 с37", "39 с38", "39 с76", "39 с77", "39 с79", "39А", "40", "40 с4", "41", "43 к1", "43 к2", "43А", "44", "44 с1", "44А с3", "44А с4", "45 к1", "45 к2", "45 к3", "45 к4", "45 к5", "45Г к35", "45Г к54", "47 с1", "47 с19", "47 с2", "47 с3", "47 с4", "47 с6", "48", "48 с10", "48 с9", "49/2", "50", "52", "54", "54А", "56", "58", "60 к1", "60 к2", "60А", "64", "64 с26", "с2", "31 с4", "33 к1", "33 к10", "33 к2", "33 к3", "33 к4", "33 к5", "33 к6", "33 к7А", "33 к8А", "33 к9", "33 с12", "33А", "35", "37Ас32", "66", "68", "74 к1", "74 к2", "74 к3", "74 к4", "74 к5", "74 к6", "74А", "76 к1", "76 к2", "76 к4", "76А", "78 к1", "78 к3", "78 к4", "78 к5", "80 к11", "80 к20", "80 к21", "80 к24", "80 к30", "80 к30А", "80 к37", "80 к41", "80 к54", "80 к56", "80 кА", "80 кБ", "62", "62А", "64 с10", "64 с2", "64 с4", "36 к2"}},
        {"Солдатская улица", new HashSet<string> {"15", "17 с1", "0 к1", "10 к2", "12 к1", "14", "17", "2 с1", "2 с2", "3", "4 с2", "4 с4", "4 с6", "6А", "8 к1", "8 к2"}}
    };

            return database;
        }

        private void SelectAddress()
        {

            string selectedStreet = SelectFromList(StreetDatabase().Keys.ToList(), "улицу");

            string selectedHouse = SelectFromList(StreetDatabase()[selectedStreet].ToList(), "номер дома");

            string room = SelectRoomNumber();

            Result = ($"{selectedStreet}, {selectedHouse}, кв. {room}");

            Console.Clear();
            Console.WriteLine("Выбранный адрес доставки добавлен :");
            Console.WriteLine(Result);
            Console.ReadLine();
        }

        private string SelectRoomNumber()
        {
            string roomnumber = null;
            string errorMessage = "";
            while (errorMessage != null)
            {
                Console.Clear();
                Console.WriteLine("Укажите номер квартиры: ");
                roomnumber = Console.ReadLine().NumValidate(out errorMessage, 0, 999);
                if (errorMessage != null)
                {
                    Console.Clear(); Console.WriteLine(errorMessage);
                    while (true) { Console.ReadKey(); break; }

                }
            }
            if (roomnumber == "0") return roomnumber = "нет";
            return roomnumber;
        }

        private string SelectFromList(List<string> items, string itemType)
        {
            int currentIndex = 0;
            ConsoleKeyInfo keyInfo;
            do
            {
                Console.Clear();
                Console.WriteLine($"Выберите {itemType} (используйте стрелки вверх/вниз, Enter для подтверждения):");
                Console.WriteLine(items[currentIndex]);

                keyInfo = Console.ReadKey(true);

                if (keyInfo.Key == ConsoleKey.UpArrow)
                {
                    currentIndex = (currentIndex - 1 + items.Count) % items.Count;
                }
                else if (keyInfo.Key == ConsoleKey.DownArrow)
                {
                    currentIndex = (currentIndex + 1) % items.Count;
                }

            } while (keyInfo.Key != ConsoleKey.Enter);

            return items[currentIndex];
        }
    }
}





